blog/Backendload_test2.txt
1:HL["/_next/static/media/e4af272ccee01ff0-s.p.woff2",{"as":"font","type":"font/woff2"}]
2:HL["/_next/static/css/b3171e58fb80086c.css",{"as":"style"}]
0:["x4x7gnlU2P7tb_3ffIoz5",[[["",{"children":["blog",{"children":[["slug","Backendload_test2","d"],{"children":["__PAGE__?{\"slug\":\"Backendload_test2\"}",{}]}]}]},"$undefined","$undefined",true],"$L3",[[["$","link","0",{"rel":"stylesheet","href":"/_next/static/css/b3171e58fb80086c.css","precedence":"next"}]],"$L4"]]]]
5:I{"id":6685,"chunks":["685:static/chunks/685-1c7543f9470b706b.js","222:static/chunks/222-846c3dee61afe17f.js","404:static/chunks/app/blog/page-4c4ed4280d9bd9ea.js"],"name":"","async":false}
6:I{"id":3222,"chunks":["685:static/chunks/685-1c7543f9470b706b.js","222:static/chunks/222-846c3dee61afe17f.js","404:static/chunks/app/blog/page-4c4ed4280d9bd9ea.js"],"name":"Image","async":false}
7:I{"id":7767,"chunks":["272:static/chunks/webpack-479ea16dcba490db.js","971:static/chunks/fd9d1056-5fc0659828b82348.js","596:static/chunks/596-5f69a5936ae99734.js"],"name":"default","async":false}
8:I{"id":7920,"chunks":["272:static/chunks/webpack-479ea16dcba490db.js","971:static/chunks/fd9d1056-5fc0659828b82348.js","596:static/chunks/596-5f69a5936ae99734.js"],"name":"default","async":false}
3:[null,["$","html",null,{"lang":"kr","children":["$","body",null,{"className":"__className_e8ce0c","children":["$","div",null,{"className":"w-full flex flex-col items-center p-3","children":[null,["$","header",null,{"className":"w-full max-w-3xl flex flex-row justify-between items-center my-1","children":[["$","$L5",null,{"href":"/","className":"flex flex-row items-center","children":[["$","$L6",null,{"src":"/logo.png","alt":"로고","width":30,"height":30,"objectFit":"cover","className":"rounded-full"}],["$","span",null,{"className":"mx-2 font-semibold text-lg","children":"jiohh blog"}]]}],["$","nav",null,{"children":[["$","$L5","Home",{"href":"/","className":"mr-5 ","children":"Home"}],["$","$L5","Blog",{"href":"/blog","className":"mr-5 ","children":"Blog"}],["$","$L5","Category",{"href":"/category","className":"mr-5 ","children":"Category"}]]}]]}],["$","main",null,{"className":"w-full max-w-3xl","children":["$","$L7",null,{"parallelRouterKey":"children","segmentPath":["children"],"error":"$undefined","errorStyles":"$undefined","loading":"$undefined","loadingStyles":"$undefined","hasLoading":false,"template":["$","$L8",null,{}],"templateStyles":"$undefined","notFound":[["$","title",null,{"children":"404: This page could not be found."}],["$","div",null,{"style":{"fontFamily":"system-ui,\"Segoe UI\",Roboto,Helvetica,Arial,sans-serif,\"Apple Color Emoji\",\"Segoe UI Emoji\"","height":"100vh","textAlign":"center","display":"flex","flexDirection":"column","alignItems":"center","justifyContent":"center"},"children":["$","div",null,{"children":[["$","style",null,{"dangerouslySetInnerHTML":{"__html":"body{color:#000;background:#fff;margin:0}.next-error-h1{border-right:1px solid rgba(0,0,0,.3)}@media (prefers-color-scheme:dark){body{color:#fff;background:#000}.next-error-h1{border-right:1px solid rgba(255,255,255,.3)}}"}}],["$","h1",null,{"className":"next-error-h1","style":{"display":"inline-block","margin":"0 20px 0 0","padding":"0 23px 0 0","fontSize":24,"fontWeight":500,"verticalAlign":"top","lineHeight":"49px"},"children":"404"}],["$","div",null,{"style":{"display":"inline-block"},"children":["$","h2",null,{"style":{"fontSize":14,"fontWeight":400,"lineHeight":"49px","margin":0},"children":"This page could not be found."}]}]]}]}]],"notFoundStyles":"$undefined","childProp":{"current":["$","$L7",null,{"parallelRouterKey":"children","segmentPath":["children","blog","children"],"error":"$undefined","errorStyles":"$undefined","loading":"$undefined","loadingStyles":"$undefined","hasLoading":false,"template":["$","$L8",null,{}],"templateStyles":"$undefined","notFound":"$undefined","notFoundStyles":"$undefined","childProp":{"current":["$","$L7",null,{"parallelRouterKey":"children","segmentPath":["children","blog","children",["slug","Backendload_test2","d"],"children"],"error":"$undefined","errorStyles":"$undefined","loading":"$undefined","loadingStyles":"$undefined","hasLoading":false,"template":["$","$L8",null,{}],"templateStyles":"$undefined","notFound":"$undefined","notFoundStyles":"$undefined","childProp":{"current":["$L9",["$","div",null,{"className":"mt-10 prose","children":[["$","h1",null,{"className":"","children":"JWT와 Session의 성능 차이는 어떻게 될까? – 부하테스트 2"}],[["$","img",null,{"src":"/images/Backend/jwt_vs_session.png","width":"100%","height":"100%"}],"\n",["$","h4",null,{"children":"JWT와 Session의 성능 차이는 어떻게 될까?"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["$","a",null,{"href":"https://an-jiohh.github.io/blog/Backendload_test1","children":"부하테스트 1 - 부하테스트 개요 및 환경 구성"}]}],"\n",["$","li",null,{"children":[["$","a",null,{"href":"https://an-jiohh.github.io/blog/Backendload_test2","children":"부하테스트 2 - 부하테스트 진행"}],"  ⬅️ 현재글"]}],"\n",["$","li",null,{"children":["$","a",null,{"href":"https://an-jiohh.github.io/blog/Backendload_test3","children":"부하테스트 3 - 부하테스트 정리 및 회고"}]}],"\n"]}],"\n",["$","hr",null,{}],"\n",["$","p",null,{"children":["부하테스트 두번째 글로 부하테스트를 어떻게 진행했는지 말해보고자 한다.",["$","br",null,{}],"\n","진행하며 어떠한 문제점이 있었고 어떻게 개선하였는지 작성하고자 하였다."]}],"\n",["$","ol",null,{"children":["\n",["$","li",null,{"children":["$","strong",null,{"children":"단일 K6 부하테스트 진행"}]}],"\n",["$","li",null,{"children":["$","strong",null,{"children":"K6 + InfluxDB + Grafana / 시계열 데이터 분석"}]}],"\n",["$","li",null,{"children":["$","strong",null,{"children":"K6 + telegraf + InfluxDb + Grafana /  시스템 메트릭 추가"}]}],"\n"]}],"\n",["$","p",null,{"children":"이러한 순서로 진행하였다."}],"\n",["$","hr",null,{}],"\n",["$","h2",null,{"children":"1. 단일 K6 부하테스트 진행"}],"\n",["$","img",null,{"src":"/images/Backend/k6_load_test.png","width":"100%","height":"100%"}],"\n",["$","p",null,{"children":["처음으로 진행한 것은 K6를 설치하고 바로 부하 테스트를 진행해본 것이였다.",["$","br",null,{}],"\n","현재 시스템에서 어느정도 버틸 수 있는지 모르는 것도 있었고 부하테스트에 대한 감을 잡지 못한 상태여서 일단 먼저 부하를 걸어보았다."]}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"vuser : 10 ~ 5000 vus"}],"\n",["$","li",null,{"children":"시간 : 30s ~ 10m"}],"\n",["$","li",null,{"children":["테스트 유형 : ",["$","strong",null,{"children":"일정 vuser로 시작"}]," 또는 ",["$","strong",null,{"children":"0부터 지정한 vuser까지 상승"}]]}],"\n"]}],"\n",["$","p",null,{"children":"조건을 계속해서 바꿔가면서 부하를 걸어보는 과정을 거쳤다."}],"\n",["$","p",null,{"children":"다음은 진행했던 여러 테스트 중 하나의 k6 결과물이다."}],"\n",["$","pre",null,{"children":["$","code",null,{"children":"█ TOTAL RESULTS \n  checks_total......: 504789 1551.230026/s\n  checks_succeeded..: 99.93% 504462 out of 504789\n  checks_failed......: 0.06%  327 out of 504789\n\n  ✗ status is 200\n    ↳  99% — ✓ 504462 / ✗ 327\n\n  HTTP\n  http_req_duration.............: avg=524.24ms min=0s       med=128.67ms max=3.18s  p(90)=1.84s p(95)=2.29s\n    { expected_response:true }..: avg=524.58ms min=646.58µs med=129.04ms max=3.18s  p(90)=1.84s p(95)=2.29s\n  http_req_failed...............: 0.06%  327 out of 504789\n  http_reqs.....................: 504789 1551.230026/s\n\n  EXECUTION\n  iteration_duration............: avg=1.54s    min=1s       med=1.13s    max=31.02s p(90)=2.84s p(95)=3.3s \n  iterations....................: 504789 1551.230026/s\n  vus...........................: 5      min=5             max=4993\n  vus_max.......................: 5000   min=5000          max=5000\n\n  NETWORK\n  data_received.................: 237 MB 728 kB/s\n  data_sent.....................: 191 MB 588 kB/s\n"}]}],"\n",["$","p",null,{"children":"정리하면 다음과 같다."}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"504462 요청 성공 / 327 요청 실패, 실패율 0.06%"}],"\n",["$","li",null,{"children":"평균 처리시간 524.24ms"}],"\n",["$","li",null,{"children":"p95 처리시간(95%를 포함하는 처리 시간) 2.29s"}],"\n"]}],"\n",["$","p",null,{"children":["최대 vuser 5000까지 진행해 보았는데 계속해서 수치를 높혀 진행해도 처리가 되긴 하였다.",["$","br",null,{}],"\n","다만 p95값이 너무 크게 나오고 실패율이 낮긴하지만 실패가 발생하였다."]}],"\n",["$","p",null,{"children":"vuser 5000이면 RPS 5000이 나온다는 것인데 너무 수치가 높게 나와 무엇인가 잘못되었다고 생각하였다. (사실 처리가 가능한 시스템이였다...)"}],"\n",["$","p",null,{"children":"결론적으로 다음으로 개선이 필요하다고 생각하였다."}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":[["$","strong",null,{"children":"테스트 유형을 정하고 진행하자."}],["$","br",null,{}],"\n","내가 필요한 테스트는 무엇일까?라는 생각이 들어 테스트에 대해 찾아보았다.",["$","br",null,{}],"\n","-> 일정 vuser을 한번에 진행하는 것이 아닌 점차 증가시키는 ",["$","strong",null,{"children":"임계점 테스트"}]," 진행"]}],"\n",["$","li",null,{"children":[["$","strong",null,{"children":"K6 결과물만으로는 원하는 결과를 파악하기 어렵다."}],["$","br",null,{}],"\n","K6 결과물은 일정 목표 수치를 정하고 이를 기반으로 테스트했을때 참고하기 좋은 형식이라고 생각하였다.",["$","br",null,{}],"\n","예시로 처리시간을 기준으로 이야기하면 전체 평균 처리시간이 결과로 나오기 때문에 임계점 테스트시\nuser가 적을때의 결과값과 클때의 결과값이 섞여 판단하기 어렵게 된다.",["$","br",null,{}],"\n","(ex 초기 처리시간 50ms, 후기 처리시간 1s 이라면 결과에서는 200ms로 정상값으로 보일 수 있음)",["$","br",null,{}],"\n","-> ",["$","strong",null,{"children":"시계열로 어느 지점에서 수치가 변화하는지 확인할 필요가 있다."}]]}],"\n"]}],"\n",["$","hr",null,{}],"\n",["$","h2",null,{"children":["2. ",["$","strong",null,{"children":"K6 + InfluxDB + Grafana / 시계열 데이터 분석"}]]}],"\n",["$","p",null,{"children":"테스트 유형을 정하는 한편 시계열 데이터를 저장하기 위한 InfluxDB, 이러한 정보를 시각적으로 표현하기 위해 Grafana를 사용하였다."}],"\n",["$","img",null,{"src":"/images/Backend/k6_Grafana.png","width":"100%","height":"100%"}],"\n",["$","p",null,{"children":"influxDB는 prometheus라는 대체제가 있었는데 간단하게 사용할 수 있다고 판단하여 influxDB를 선택했다."}],"\n",["$","p",null,{"children":"추가적으로 여기서부터는 Docker도 추가하였는데 로컬에 설치하여 사용할 수도 있었으나 Docker-Compose를 사용하여 쉽게 환경을 구성하고도 싶었고\n이러한 내용을 Git으로 기록(유지)하고도 싶었기 때문에 사용하였다."}],"\n",["$","img",null,{"src":"/images/Backend/grafana_result.png","width":"100%","height":"100%"}],"\n",["$","blockquote",null,{"children":["\n",["$","p",null,{"children":["$","strong",null,{"children":"이제 시간대별로 수치가 어떻게 변화하는지 확인할 수 있게 됐다."}]}],"\n"]}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"시간 : 5m"}],"\n",["$","li",null,{"children":"Vuser : 0 에서 5000까지 vuser 증가"}],"\n"]}],"\n",["$","p",null,{"children":"해당 조건으로 각각 session과 jwt 방식으로 진행한 후 분석해 보았다."}],"\n",["$","p",null,{"children":"추후 시간이 너무 짧지 않은가 싶어 25분으로 증가율을 조정하여 실시했으나 비슷한 양상이였다."}],"\n",["$","p",null,{"children":["확인한 수치는 ",["$","strong",null,{"children":"RPS, ERROR 발생 시간, P95 응답시간"}],"이다.",["$","br",null,{}],"\n","Vuser수가 동일하게 증가함으로 Vuser를 기준으로 임계지점을 나타내었다.",["$","br",null,{}],"\n","수치로 최대한 나타내려고 하였으나 임의적으로 나타낼 수 밖에 없는 부분이 많았던 것 같다."]}],"\n",["$","h3",null,{"children":"세션 분석"}],"\n",["$","img",null,{"src":"/images/Backend/session_load_1.png","width":"100%","height":"100%"}],"\n",["$","h4",null,{"children":"RPS"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 2.20K 부분에서 추세 살짝 완만해짐, 그러나 계속 증가하는 추세",["$","br",null,{}],"\n","RPS 2.20K로 Vuser 수와 동일"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 2.67K 부분부터 RPS가 요동 치기 시작, 하지만 계속 증가하는 추세",["$","br",null,{}],"\n","RPS 2.57K로 Vuser보다 미달"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 3.47K 부분에서 RPS가 급격히 요동 치기 시작",["$","br",null,{}],"\n","RPS 3.47K이나 일시적 Vuser 수"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":"Vuser 4.28K 부분에서 RPS 3.73K으로 최대치 기록"}],"\n"]}],"\n"]}],"\n",["$","p",null,{"children":["처음 추세가 완만해지는 부분이 빠르나 그 이후 임계점에 늦게 도달함",["$","br",null,{}],"\n","최대 RPS : ",["$","strong",null,{"children":"3.73K"}],", 임계점 : ",["$","strong",null,{"children":"3.47K"}]]}],"\n",["$","h4",null,{"children":"ERROR"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["Vuser 2.67K 부분에서 처음으로 ERROR 9건 발생",["$","br",null,{}],"\n","RPS 2.58K",["$","br",null,{}],"\n","이후 산발적으로 발생,"]}],"\n"]}],"\n",["$","p",null,{"children":"ERROR가 발생하긴하나 특정한 패턴을 찾기 어려움"}],"\n",["$","h4",null,{"children":"P95"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["Vuser 3.00K 부분에서 578ms으로 상승",["$","br",null,{}],"\n","= 처음으로 500ms 이상으로 상승, 이후 p95 수치 점차 증가"]}],"\n"]}],"\n",["$","h3",null,{"children":"JWT 분석"}],"\n",["$","img",null,{"src":"/images/Backend/jwt_load_1.png","width":"100%","height":"100%"}],"\n",["$","h4",null,{"children":"RPS"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 2.64K 부분에서 상승세 꺽임 = 시스템 임계점 근접",["$","br",null,{}],"\n","RPS 2.63K로 Vuser 수와 동일"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 2.94K 부분부터 RPS가 요동 치기 시작 = 시스템 임계점 도달",["$","br",null,{}],"\n","RPS 2.69K로 Vuser보다 미달",["$","br",null,{}],"\n","이전 단계인 상승세가 꺽인 부분부터 조금의 시간이 흐른 후 임계점 도달"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":"Vuser 3.59K 부분에서 RPS 3.47K으로 최대치 기록"}],"\n"]}],"\n"]}],"\n",["$","h4",null,{"children":"ERROR"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["Vuser 3.20K 부분에서 처음으로 ERROR 9건 발생",["$","br",null,{}],"\n","RPS 1.7K / 2.9K 변동\n이후 산발적으로 발생"]}],"\n"]}],"\n",["$","h4",null,{"children":"P95"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["Vuser 2.87K 부분에서 501ms으로 상승",["$","br",null,{}],"\n","= 처음으로 500ms 이상으로 상승, 이후 p95 수치 점차 증가"]}],"\n"]}],"\n",["$","h3",null,{"children":"수치 분석"}],"\n",["$","p",null,{"children":"전반적인 수치를 바탕으로 분석해보았을때 다음과 같다."}],"\n",["$","h4",null,{"children":"RPS"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":[["$","strong",null,{"children":"세션방식(최대 RPS 3.73K)"}],", ",["$","strong",null,{"children":"JWT방식(최대 RPS 3.37K)"}],", 세션방식이 최대 RPS로 ",["$","strong",null,{"children":"10.7%"}]," 더 높음"]}],"\n",["$","li",null,{"children":["임계점을 안정적으로 RPS 수치를 내는 지점(RPS가 요동치기전)으로 하였을때",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션방식(최대 RPS 3.47K)"}],", ",["$","strong",null,{"children":"JWT방식(최대 RPS 2.94K)"}],", 세션방식이 ",["$","strong",null,{"children":"18.8%"}]," 더 높음"]}],"\n"]}],"\n",["$","h4",null,{"children":"Error 발생 시점 및 분포"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":[["$","strong",null,{"children":"세션방식(Vuser 2.67K)"}],", ",["$","strong",null,{"children":"JWT방식(Vuser 3.20K)"}]," JWT방식이 오류 발생 시점이 더 늦음"]}],"\n"]}],"\n",["$","h4",null,{"children":"응답시간"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["전체 평균 응답시간",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션방식(315.35ms)"}],", ",["$","strong",null,{"children":"JWT방식(524.31ms)"}]," 세션방식이 전체 응답시간이 39.84% 빠름"]}],"\n",["$","li",null,{"children":["P95 응답시간",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션방식(1.31s)"}],", ",["$","strong",null,{"children":"JWT방식(2.30s)"}]," 세션방식이 P95 응답시간이 43.04% 빠름"]}],"\n",["$","li",null,{"children":["P95 기준 임계점(500ms 초과 시점)",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션방식(Vuser 3.00K)"}],", ",["$","strong",null,{"children":"JWT방식(Vuser 2.87K)"}]," 세션방식이 초과 시점이 늦음"]}],"\n"]}],"\n",["$","p",null,{"children":["정리하자면 ",["$","strong",null,{"children":"RPS 기준 10.7% ~ 18.8%"}],", ",["$","strong",null,{"children":"응답시간 기준 약 40%"}]," 정도 세션방식이 빠른것으로 말할 수 있다."]}],"\n",["$","h3",null,{"children":"다음으로는?"}],"\n",["$","p",null,{"children":["변화하는 수치를 보면서 CPU사용량등과 같이 시스템 메트릭 또한 참고해야하지 않을까 생각하였다.",["$","br",null,{}],"\n","RPS뿐만아니라 다양한 수치를 확인하고 이를 기준으로 임계점을 찾아보았는데\n시스템 메트릭 또한 임계점에 대한 기준으로 파악할 수 있을 뿐만 아니라 개선점을 찾기위한 필수적인 메트릭으로 생각하였기 때문이다."]}],"\n",["$","hr",null,{}],"\n",["$","h2",null,{"children":["3. ",["$","strong",null,{"children":"K6 + telegraf + InfluxDb + Grafana /  시스템 메트릭 추가"}]]}],"\n",["$","img",null,{"src":"/images/Backend/load_testing.png","width":"100%","height":"100%"}],"\n",["$","p",null,{"children":"기존 구조에서 telegraf가 추가되었다."}],"\n",["$","p",null,{"children":["프로메테우스 환경에서는 Node exporter를 사용하는 것 같고, 도커 내부에 시스템 메트릭을 보내주는 도구가 있다고는 들었는데",["$","br",null,{}],"\n","현재 로컬에서 서버를 사용하는 구조, influxDB를 사용하는 상황상 telegraf가 맞다고 생각하였다."]}],"\n",["$","p",null,{"children":["주로 확인한 메트릭은 ",["$","strong",null,{"children":"CPU 사용률"}],",",["$","strong",null,{"children":"메모레 사용률"}],", ",["$","strong",null,{"children":"디스크 사용률"}],"이다.",["$","br",null,{}],"\n","기존과 동일한 상황에 시스템 메트릭만 추가하였다."]}],"\n",["$","h3",null,{"children":"세션 분석"}],"\n",["$","img",null,{"src":"/images/Backend/session_load_2.png","width":"100%","height":"100%"}],"\n",["$","h4",null,{"children":"CPU 사용률"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 3.00K 부분에서 94.6%으로 처음으로 90% 도달, 시스템 임계점 근접",["$","br",null,{}],"\n","이후 90% 초반대로 점차 증가"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":"Vuser 3.70K 부분부터 98.1%로 이전까지는 90%후반 진입"}],"\n"]}],"\n"]}],"\n",["$","h4",null,{"children":"메모리 사용률"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"시작 64%에서 종료까지 점차 74%로 상승하였지만 특이사항 없음"}],"\n"]}],"\n",["$","h4",null,{"children":"디스크 사용률"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"시작 48%에서 종료까지 점차 48.46으로 상승하였지만 특이사항 없음"}],"\n"]}],"\n",["$","h3",null,{"children":"JWT 분석"}],"\n",["$","img",null,{"src":"/images/Backend/jwt_load_2.png","width":"100%","height":"100%"}],"\n",["$","h4",null,{"children":"CPU 사용률"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 1.97K 부분에서 92.8%으로 처음으로 90% 도달, 시스템 임계점 근접",["$","br",null,{}],"\n","이후 90% 초반대로 점차 증가"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":"Vuser 2.80K 부분부터 98.2%로 이전까지는 90%초 였지만 100%대를 찍기시작"}],"\n"]}],"\n"]}],"\n",["$","p",null,{"children":"CPU 사용률이 전체적으로 강한 스파이크 형태를 보임"}],"\n",["$","h4",null,{"children":"메모리 사용률"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"시작 70%에서 종료까지 점차 76%로 상승하였지만 특이사항 없음"}],"\n"]}],"\n",["$","h4",null,{"children":"디스크 사용률"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"시작 48.46%에서 종료까지 점차 48.52%으로 상승하였지만 특이사항 없음"}],"\n"]}],"\n",["$","h3",null,{"children":"수치 분석"}],"\n",["$","h4",null,{"children":"CPU 사용률"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["90% 초과 진입 시점",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션 방식 Vuser 3.00K (94.6%)"}],", ",["$","strong",null,{"children":"JWT방식 Vuser 1.97K (92.8%)"}],["$","br",null,{}],"\n","JWT가 더 빠르게 CPU 임계점에 도달함 - 1.03K 차이"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["98% 이상 진입 시점\n",["$","strong",null,{"children":"세션 방식 Vuser 3.70K (98.1%)"}],", ",["$","strong",null,{"children":"JWT 방식 Vuser 2.80K (98.2%)"}],"\nJWT가 더 이른 시점에 한계 도달 - 0.9K 차이는"]}],"\n"]}],"\n"]}],"\n",["$","h4",null,{"children":"메모리 사용률 분석"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"두 방식 모두 안정적인 사용패턴을 보이며 특이사항없음"}],"\n"]}],"\n",["$","h4",null,{"children":"디스크 사용률 분석"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"두 방식 모두 안정적인 사용패턴을 보이며 특이사항없음"}],"\n"]}],"\n",["$","p",null,{"children":["확실히 CPU 사용량을 파악하니 성능차이가 더욱 도드라지게 보였다.",["$","br",null,{}],"\n","서명검증 및 디코딩등 연산이 많이 필요한 JWT방식에서 CPU사용량 임계점이 빨리 도달하였고 사용량의 안정성(스파이크)또한 JWT 방식이 더 낮았다."]}],"\n",["$","hr",null,{}],"\n",["$","p",null,{"children":["지금까지 진행했던 부분을 시간순서대로 작성하다보니 양이 많아진 것 같다.",["$","br",null,{}],"\n","다음 글에서는 간단한 정리 및 회고로 끝내보고자 한다."]}]]]}],null],"segment":"__PAGE__?{\"slug\":\"Backendload_test2\"}"},"styles":[]}],"segment":["slug","Backendload_test2","d"]},"styles":[]}],"segment":"blog"},"styles":[]}]}],["$","footer",null,{"className":"w-full max-w-3xl items-center ","children":[["$","div",null,{"className":"h-28"}]," "]}]]}]}]}],null]
4:[["$","meta","0",{"charSet":"utf-8"}],["$","title","1",{"children":"JWT와 Session의 성능 차이는 어떻게 될까? – 부하테스트 2"}],["$","meta","2",{"name":"description","content":"부하테스트 진행"}],["$","meta","3",{"name":"viewport","content":"width=device-width, initial-scale=1"}],["$","meta","4",{"name":"google-site-verification","content":"LXzAKbA2-HVF1l60gXdTElFNxVVLxh1rk6qwe1V41so"}],["$","link","5",{"rel":"icon","href":"/favicon.ico","type":"image/x-icon","sizes":"16x16"}],["$","meta","6",{"name":"next-size-adjust"}]]
9:null